HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMcdslight_bf.h
/**
 * \file IfxMcdslight_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC35XA_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Mcdslight_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Mcdslight_Registers
 * 
 */
#ifndef IFXMCDSLIGHT_BF_H
#define IFXMCDSLIGHT_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Mcdslight_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_MCDSLIGHT_CLC_Bits.DISR */
#define IFX_MCDSLIGHT_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_CLC_Bits.DISR */
#define IFX_MCDSLIGHT_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_CLC_Bits.DISR */
#define IFX_MCDSLIGHT_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_CLC_Bits.DISS */
#define IFX_MCDSLIGHT_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_CLC_Bits.DISS */
#define IFX_MCDSLIGHT_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_CLC_Bits.DISS */
#define IFX_MCDSLIGHT_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_MCDSLIGHT_OCS_Bits.SUS */
#define IFX_MCDSLIGHT_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_OCS_Bits.SUS */
#define IFX_MCDSLIGHT_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_OCS_Bits.SUS */
#define IFX_MCDSLIGHT_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_MCDSLIGHT_OCS_Bits.SUS_P */
#define IFX_MCDSLIGHT_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_OCS_Bits.SUS_P */
#define IFX_MCDSLIGHT_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_OCS_Bits.SUS_P */
#define IFX_MCDSLIGHT_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_MCDSLIGHT_OCS_Bits.SUSSTA */
#define IFX_MCDSLIGHT_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_OCS_Bits.SUSSTA */
#define IFX_MCDSLIGHT_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_OCS_Bits.SUSSTA */
#define IFX_MCDSLIGHT_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_MCDSLIGHT_ID_Bits.MOD_REV */
#define IFX_MCDSLIGHT_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_MCDSLIGHT_ID_Bits.MOD_REV */
#define IFX_MCDSLIGHT_ID_MOD_REV_MSK (0xffu)

/** \brief Offset for Ifx_MCDSLIGHT_ID_Bits.MOD_REV */
#define IFX_MCDSLIGHT_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_ID_Bits.MOD_TYPE */
#define IFX_MCDSLIGHT_ID_MOD_TYPE_LEN (8u)

/** \brief Mask for Ifx_MCDSLIGHT_ID_Bits.MOD_TYPE */
#define IFX_MCDSLIGHT_ID_MOD_TYPE_MSK (0xffu)

/** \brief Offset for Ifx_MCDSLIGHT_ID_Bits.MOD_TYPE */
#define IFX_MCDSLIGHT_ID_MOD_TYPE_OFF (8u)

/** \brief Length for Ifx_MCDSLIGHT_ID_Bits.MOD_NUMBER */
#define IFX_MCDSLIGHT_ID_MOD_NUMBER_LEN (16u)

/** \brief Mask for Ifx_MCDSLIGHT_ID_Bits.MOD_NUMBER */
#define IFX_MCDSLIGHT_ID_MOD_NUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_MCDSLIGHT_ID_Bits.MOD_NUMBER */
#define IFX_MCDSLIGHT_ID_MOD_NUMBER_OFF (16u)

/** \brief Length for Ifx_MCDSLIGHT_CT_Bits.KOK */
#define IFX_MCDSLIGHT_CT_KOK_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_CT_Bits.KOK */
#define IFX_MCDSLIGHT_CT_KOK_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_CT_Bits.KOK */
#define IFX_MCDSLIGHT_CT_KOK_OFF (5u)

/** \brief Length for Ifx_MCDSLIGHT_CT_Bits.CLRK */
#define IFX_MCDSLIGHT_CT_CLRK_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_CT_Bits.CLRK */
#define IFX_MCDSLIGHT_CT_CLRK_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_CT_Bits.CLRK */
#define IFX_MCDSLIGHT_CT_CLRK_OFF (6u)

/** \brief Length for Ifx_MCDSLIGHT_CT_Bits.KAV */
#define IFX_MCDSLIGHT_CT_KAV_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_CT_Bits.KAV */
#define IFX_MCDSLIGHT_CT_KAV_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_CT_Bits.KAV */
#define IFX_MCDSLIGHT_CT_KAV_OFF (7u)

/** \brief Length for Ifx_MCDSLIGHT_CT_Bits.EN */
#define IFX_MCDSLIGHT_CT_EN_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_CT_Bits.EN */
#define IFX_MCDSLIGHT_CT_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_CT_Bits.EN */
#define IFX_MCDSLIGHT_CT_EN_OFF (13u)

/** \brief Length for Ifx_MCDSLIGHT_CT_Bits.CLRE */
#define IFX_MCDSLIGHT_CT_CLRE_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_CT_Bits.CLRE */
#define IFX_MCDSLIGHT_CT_CLRE_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_CT_Bits.CLRE */
#define IFX_MCDSLIGHT_CT_CLRE_OFF (14u)

/** \brief Length for Ifx_MCDSLIGHT_CT_Bits.SETE */
#define IFX_MCDSLIGHT_CT_SETE_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_CT_Bits.SETE */
#define IFX_MCDSLIGHT_CT_SETE_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_CT_Bits.SETE */
#define IFX_MCDSLIGHT_CT_SETE_OFF (15u)

/** \brief Length for Ifx_MCDSLIGHT_CT_Bits.BED */
#define IFX_MCDSLIGHT_CT_BED_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_CT_Bits.BED */
#define IFX_MCDSLIGHT_CT_BED_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_CT_Bits.BED */
#define IFX_MCDSLIGHT_CT_BED_OFF (16u)

/** \brief Length for Ifx_MCDSLIGHT_CT_Bits.BED_P */
#define IFX_MCDSLIGHT_CT_BED_P_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_CT_Bits.BED_P */
#define IFX_MCDSLIGHT_CT_BED_P_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_CT_Bits.BED_P */
#define IFX_MCDSLIGHT_CT_BED_P_OFF (19u)

/** \brief Length for Ifx_MCDSLIGHT_CT_Bits.IRA */
#define IFX_MCDSLIGHT_CT_IRA_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_CT_Bits.IRA */
#define IFX_MCDSLIGHT_CT_IRA_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_CT_Bits.IRA */
#define IFX_MCDSLIGHT_CT_IRA_OFF (21u)

/** \brief Length for Ifx_MCDSLIGHT_CT_Bits.CLRI */
#define IFX_MCDSLIGHT_CT_CLRI_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_CT_Bits.CLRI */
#define IFX_MCDSLIGHT_CT_CLRI_MSK (0x1u)

