HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMcdslight_bf.h
/** \brief Offset for Ifx_MCDSLIGHT_CT_Bits.CLRI */
#define IFX_MCDSLIGHT_CT_CLRI_OFF (22u)

/** \brief Length for Ifx_MCDSLIGHT_CT_Bits.IWA */
#define IFX_MCDSLIGHT_CT_IWA_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_CT_Bits.IWA */
#define IFX_MCDSLIGHT_CT_IWA_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_CT_Bits.IWA */
#define IFX_MCDSLIGHT_CT_IWA_OFF (23u)

/** \brief Length for Ifx_MCDSLIGHT_CT_Bits.RES */
#define IFX_MCDSLIGHT_CT_RES_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_CT_Bits.RES */
#define IFX_MCDSLIGHT_CT_RES_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_CT_Bits.RES */
#define IFX_MCDSLIGHT_CT_RES_OFF (29u)

/** \brief Length for Ifx_MCDSLIGHT_CT_Bits.SETR */
#define IFX_MCDSLIGHT_CT_SETR_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_CT_Bits.SETR */
#define IFX_MCDSLIGHT_CT_SETR_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_CT_Bits.SETR */
#define IFX_MCDSLIGHT_CT_SETR_OFF (31u)

/** \brief Length for Ifx_MCDSLIGHT_MUX_Bits.TMUX0 */
#define IFX_MCDSLIGHT_MUX_TMUX0_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_MUX_Bits.TMUX0 */
#define IFX_MCDSLIGHT_MUX_TMUX0_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_MUX_Bits.TMUX0 */
#define IFX_MCDSLIGHT_MUX_TMUX0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_MUX_Bits.TM0_P */
#define IFX_MCDSLIGHT_MUX_TM0_P_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_MUX_Bits.TM0_P */
#define IFX_MCDSLIGHT_MUX_TM0_P_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_MUX_Bits.TM0_P */
#define IFX_MCDSLIGHT_MUX_TM0_P_OFF (7u)

/** \brief Length for Ifx_MCDSLIGHT_MUX_Bits.TMUX1 */
#define IFX_MCDSLIGHT_MUX_TMUX1_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_MUX_Bits.TMUX1 */
#define IFX_MCDSLIGHT_MUX_TMUX1_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_MUX_Bits.TMUX1 */
#define IFX_MCDSLIGHT_MUX_TMUX1_OFF (8u)

/** \brief Length for Ifx_MCDSLIGHT_MUX_Bits.TM1_P */
#define IFX_MCDSLIGHT_MUX_TM1_P_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_MUX_Bits.TM1_P */
#define IFX_MCDSLIGHT_MUX_TM1_P_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_MUX_Bits.TM1_P */
#define IFX_MCDSLIGHT_MUX_TM1_P_OFF (15u)

/** \brief Length for Ifx_MCDSLIGHT_MUX_Bits.TMUX2 */
#define IFX_MCDSLIGHT_MUX_TMUX2_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_MUX_Bits.TMUX2 */
#define IFX_MCDSLIGHT_MUX_TMUX2_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_MUX_Bits.TMUX2 */
#define IFX_MCDSLIGHT_MUX_TMUX2_OFF (16u)

/** \brief Length for Ifx_MCDSLIGHT_MUX_Bits.TM2_P */
#define IFX_MCDSLIGHT_MUX_TM2_P_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_MUX_Bits.TM2_P */
#define IFX_MCDSLIGHT_MUX_TM2_P_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_MUX_Bits.TM2_P */
#define IFX_MCDSLIGHT_MUX_TM2_P_OFF (23u)

/** \brief Length for Ifx_MCDSLIGHT_MUX_Bits.TMUX3 */
#define IFX_MCDSLIGHT_MUX_TMUX3_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_MUX_Bits.TMUX3 */
#define IFX_MCDSLIGHT_MUX_TMUX3_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_MUX_Bits.TMUX3 */
#define IFX_MCDSLIGHT_MUX_TMUX3_OFF (24u)

/** \brief Length for Ifx_MCDSLIGHT_MUX_Bits.TM3_P */
#define IFX_MCDSLIGHT_MUX_TM3_P_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_MUX_Bits.TM3_P */
#define IFX_MCDSLIGHT_MUX_TM3_P_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_MUX_Bits.TM3_P */
#define IFX_MCDSLIGHT_MUX_TM3_P_OFF (31u)

/** \brief Length for Ifx_MCDSLIGHT_SESSIDL_Bits.KEY_31_0 */
#define IFX_MCDSLIGHT_SESSIDL_KEY_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_SESSIDL_Bits.KEY_31_0 */
#define IFX_MCDSLIGHT_SESSIDL_KEY_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_SESSIDL_Bits.KEY_31_0 */
#define IFX_MCDSLIGHT_SESSIDL_KEY_31_0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_SESSIDH_Bits.KEY_63_32 */
#define IFX_MCDSLIGHT_SESSIDH_KEY_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_SESSIDH_Bits.KEY_63_32 */
#define IFX_MCDSLIGHT_SESSIDH_KEY_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_SESSIDH_Bits.KEY_63_32 */
#define IFX_MCDSLIGHT_SESSIDH_KEY_63_32_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.TC_MUX0 */
#define IFX_MCDSLIGHT_MUX_TC_RC_TC_MUX0_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.TC_MUX0 */
#define IFX_MCDSLIGHT_MUX_TC_RC_TC_MUX0_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.TC_MUX0 */
#define IFX_MCDSLIGHT_MUX_TC_RC_TC_MUX0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.TC_MUX1 */
#define IFX_MCDSLIGHT_MUX_TC_RC_TC_MUX1_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.TC_MUX1 */
#define IFX_MCDSLIGHT_MUX_TC_RC_TC_MUX1_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.TC_MUX1 */
#define IFX_MCDSLIGHT_MUX_TC_RC_TC_MUX1_OFF (2u)

/** \brief Length for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.TC_MUX2 */
#define IFX_MCDSLIGHT_MUX_TC_RC_TC_MUX2_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.TC_MUX2 */
#define IFX_MCDSLIGHT_MUX_TC_RC_TC_MUX2_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.TC_MUX2 */
#define IFX_MCDSLIGHT_MUX_TC_RC_TC_MUX2_OFF (4u)

/** \brief Length for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.TC_TM_P */
#define IFX_MCDSLIGHT_MUX_TC_RC_TC_TM_P_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.TC_TM_P */
#define IFX_MCDSLIGHT_MUX_TC_RC_TC_TM_P_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.TC_TM_P */
#define IFX_MCDSLIGHT_MUX_TC_RC_TC_TM_P_OFF (15u)

/** \brief Length for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.RC */
#define IFX_MCDSLIGHT_MUX_TC_RC_RC_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.RC */
#define IFX_MCDSLIGHT_MUX_TC_RC_RC_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.RC */
#define IFX_MCDSLIGHT_MUX_TC_RC_RC_OFF (24u)

/** \brief Length for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.RC_P */
#define IFX_MCDSLIGHT_MUX_TC_RC_RC_P_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.RC_P */
#define IFX_MCDSLIGHT_MUX_TC_RC_RC_P_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_MUX_TC_RC_Bits.RC_P */
#define IFX_MCDSLIGHT_MUX_TC_RC_RC_P_OFF (27u)

/** \brief Length for Ifx_MCDSLIGHT_ACCEN0_Bits.EN0 */
#define IFX_MCDSLIGHT_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_ACCEN0_Bits.EN0 */
#define IFX_MCDSLIGHT_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN0 */
#define IFX_MCDSLIGHT_ACCEN0_EN0_OFF (0u)

