HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMcdslight_bf.h
/** \brief Mask for Ifx_MCDSLIGHT_TCXWD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDSLIGHT_TCXWD_HRNG_RANGE_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXWD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDSLIGHT_TCXWD_HRNG_RANGE_63_32_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXWD_MSK_Bits.MASK_31_0 */
#define IFX_MCDSLIGHT_TCXWD_MSK_MASK_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXWD_MSK_Bits.MASK_31_0 */
#define IFX_MCDSLIGHT_TCXWD_MSK_MASK_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXWD_MSK_Bits.MASK_31_0 */
#define IFX_MCDSLIGHT_TCXWD_MSK_MASK_31_0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXWD_HMSK_Bits.MASK_63_32 */
#define IFX_MCDSLIGHT_TCXWD_HMSK_MASK_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXWD_HMSK_Bits.MASK_63_32 */
#define IFX_MCDSLIGHT_TCXWD_HMSK_MASK_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXWD_HMSK_Bits.MASK_63_32 */
#define IFX_MCDSLIGHT_TCXWD_HMSK_MASK_63_32_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXWD_SGN_Bits.SIGN */
#define IFX_MCDSLIGHT_TCXWD_SGN_SIGN_LEN (6u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXWD_SGN_Bits.SIGN */
#define IFX_MCDSLIGHT_TCXWD_SGN_SIGN_MSK (0x3fu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXWD_SGN_Bits.SIGN */
#define IFX_MCDSLIGHT_TCXWD_SGN_SIGN_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXWD_SGN_Bits.EITHER */
#define IFX_MCDSLIGHT_TCXWD_SGN_EITHER_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXWD_SGN_Bits.EITHER */
#define IFX_MCDSLIGHT_TCXWD_SGN_EITHER_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXWD_SGN_Bits.EITHER */
#define IFX_MCDSLIGHT_TCXWD_SGN_EITHER_OFF (14u)

/** \brief Length for Ifx_MCDSLIGHT_TCXWD_SGN_Bits.BELOW */
#define IFX_MCDSLIGHT_TCXWD_SGN_BELOW_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXWD_SGN_Bits.BELOW */
#define IFX_MCDSLIGHT_TCXWD_SGN_BELOW_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXWD_SGN_Bits.BELOW */
#define IFX_MCDSLIGHT_TCXWD_SGN_BELOW_OFF (15u)

/** \brief Length for Ifx_MCDSLIGHT_TCXWD_SGN_Bits.RELOAD */
#define IFX_MCDSLIGHT_TCXWD_SGN_RELOAD_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXWD_SGN_Bits.RELOAD */
#define IFX_MCDSLIGHT_TCXWD_SGN_RELOAD_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXWD_SGN_Bits.RELOAD */
#define IFX_MCDSLIGHT_TCXWD_SGN_RELOAD_OFF (16u)

/** \brief Length for Ifx_MCDSLIGHT_TCXAC_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCXAC_BND_BOUND_LEN (14u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXAC_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCXAC_BND_BOUND_MSK (0x3fffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXAC_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCXAC_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXAC_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCXAC_RNG_RANGE_LEN (14u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXAC_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCXAC_RNG_RANGE_MSK (0x3fffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXAC_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCXAC_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.SVM */
#define IFX_MCDSLIGHT_TCXAC_MSK_SVM_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.SVM */
#define IFX_MCDSLIGHT_TCXAC_MSK_SVM_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.SVM */
#define IFX_MCDSLIGHT_TCXAC_MSK_SVM_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.MASTER */
#define IFX_MCDSLIGHT_TCXAC_MSK_MASTER_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.MASTER */
#define IFX_MCDSLIGHT_TCXAC_MSK_MASTER_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.MASTER */
#define IFX_MCDSLIGHT_TCXAC_MSK_MASTER_OFF (1u)

/** \brief Length for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.SUBCHANNEL */
#define IFX_MCDSLIGHT_TCXAC_MSK_SUBCHANNEL_LEN (7u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.SUBCHANNEL */
#define IFX_MCDSLIGHT_TCXAC_MSK_SUBCHANNEL_MSK (0x7fu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.SUBCHANNEL */
#define IFX_MCDSLIGHT_TCXAC_MSK_SUBCHANNEL_OFF (5u)

/** \brief Length for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.WR */
#define IFX_MCDSLIGHT_TCXAC_MSK_WR_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.WR */
#define IFX_MCDSLIGHT_TCXAC_MSK_WR_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.WR */
#define IFX_MCDSLIGHT_TCXAC_MSK_WR_OFF (12u)

/** \brief Length for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.RD */
#define IFX_MCDSLIGHT_TCXAC_MSK_RD_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.RD */
#define IFX_MCDSLIGHT_TCXAC_MSK_RD_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.RD */
#define IFX_MCDSLIGHT_TCXAC_MSK_RD_OFF (13u)

/** \brief Length for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.MSK */
#define IFX_MCDSLIGHT_TCXAC_MSK_MSK_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.MSK */
#define IFX_MCDSLIGHT_TCXAC_MSK_MSK_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXAC_MSK_Bits.MSK */
#define IFX_MCDSLIGHT_TCXAC_MSK_MSK_OFF (14u)

/** \brief Length for Ifx_MCDSLIGHT_TCXDTUFLV_Bits.CURLVL0 */
#define IFX_MCDSLIGHT_TCXDTUFLV_CURLVL0_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXDTUFLV_Bits.CURLVL0 */
#define IFX_MCDSLIGHT_TCXDTUFLV_CURLVL0_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXDTUFLV_Bits.CURLVL0 */
#define IFX_MCDSLIGHT_TCXDTUFLV_CURLVL0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXDTUFLV_Bits.MAXLVL0 */
#define IFX_MCDSLIGHT_TCXDTUFLV_MAXLVL0_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXDTUFLV_Bits.MAXLVL0 */
#define IFX_MCDSLIGHT_TCXDTUFLV_MAXLVL0_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXDTUFLV_Bits.MAXLVL0 */
#define IFX_MCDSLIGHT_TCXDTUFLV_MAXLVL0_OFF (4u)

/** \brief Length for Ifx_MCDSLIGHT_TCXDTUFLV_Bits.CURLVL1 */
#define IFX_MCDSLIGHT_TCXDTUFLV_CURLVL1_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXDTUFLV_Bits.CURLVL1 */
#define IFX_MCDSLIGHT_TCXDTUFLV_CURLVL1_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXDTUFLV_Bits.CURLVL1 */
#define IFX_MCDSLIGHT_TCXDTUFLV_CURLVL1_OFF (8u)

/** \brief Length for Ifx_MCDSLIGHT_TCXDTUFLV_Bits.MAXLVL1 */
#define IFX_MCDSLIGHT_TCXDTUFLV_MAXLVL1_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXDTUFLV_Bits.MAXLVL1 */
#define IFX_MCDSLIGHT_TCXDTUFLV_MAXLVL1_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXDTUFLV_Bits.MAXLVL1 */
#define IFX_MCDSLIGHT_TCXDTUFLV_MAXLVL1_OFF (12u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ0 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ0_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ0 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ0_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ0 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ1 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ1_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ1 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ1_MSK (0x3u)

