HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMcdslight_bf.h
/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ1 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ1_OFF (2u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ2 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ2_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ2 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ2_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ2 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ2_OFF (4u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ3 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ3_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ3 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ3_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ3 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ3_OFF (6u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ4 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ4_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ4 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ4_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ4 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ4_OFF (8u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ5 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ5_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ5 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ5_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ5 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ5_OFF (10u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ6 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ6_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ6 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ6_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ6 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ6_OFF (12u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ7 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ7_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ7 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ7_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ7 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ7_OFF (14u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ8 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ8_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ8 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ8_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ8 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ8_OFF (16u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ9 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ9_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ9 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ9_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ9 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ9_OFF (18u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ10 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ10_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ10 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ10_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ10 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ10_OFF (20u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ11 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ11_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ11 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ11_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ11 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ11_OFF (22u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ12 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ12_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ12 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ12_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ12 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ12_OFF (24u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ13 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ13_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ13 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ13_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ13 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ13_OFF (26u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ14 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ14_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ14 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ14_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ14 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ14_OFF (28u)

/** \brief Length for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ15 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ15_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ15 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ15_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXEVT_Bits.EIQ15 */
#define IFX_MCDSLIGHT_TCXEVT_EIQ15_OFF (30u)

/** \brief Length for Ifx_MCDSLIGHT_TCXACT_Bits.AIS0 */
#define IFX_MCDSLIGHT_TCXACT_AIS0_LEN (5u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXACT_Bits.AIS0 */
#define IFX_MCDSLIGHT_TCXACT_AIS0_MSK (0x1fu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXACT_Bits.AIS0 */
#define IFX_MCDSLIGHT_TCXACT_AIS0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXACT_Bits.AIQ0 */
#define IFX_MCDSLIGHT_TCXACT_AIQ0_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXACT_Bits.AIQ0 */
#define IFX_MCDSLIGHT_TCXACT_AIQ0_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXACT_Bits.AIQ0 */
#define IFX_MCDSLIGHT_TCXACT_AIQ0_OFF (5u)

/** \brief Length for Ifx_MCDSLIGHT_TCXACT_Bits.LV0 */
#define IFX_MCDSLIGHT_TCXACT_LV0_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXACT_Bits.LV0 */
#define IFX_MCDSLIGHT_TCXACT_LV0_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXACT_Bits.LV0 */
#define IFX_MCDSLIGHT_TCXACT_LV0_OFF (7u)

/** \brief Length for Ifx_MCDSLIGHT_TCXACT_Bits.AIS1 */
#define IFX_MCDSLIGHT_TCXACT_AIS1_LEN (5u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXACT_Bits.AIS1 */
#define IFX_MCDSLIGHT_TCXACT_AIS1_MSK (0x1fu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXACT_Bits.AIS1 */
#define IFX_MCDSLIGHT_TCXACT_AIS1_OFF (8u)

/** \brief Length for Ifx_MCDSLIGHT_TCXACT_Bits.AIQ1 */
#define IFX_MCDSLIGHT_TCXACT_AIQ1_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXACT_Bits.AIQ1 */
#define IFX_MCDSLIGHT_TCXACT_AIQ1_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXACT_Bits.AIQ1 */
#define IFX_MCDSLIGHT_TCXACT_AIQ1_OFF (13u)

/** \brief Length for Ifx_MCDSLIGHT_TCXACT_Bits.LV1 */
#define IFX_MCDSLIGHT_TCXACT_LV1_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXACT_Bits.LV1 */
#define IFX_MCDSLIGHT_TCXACT_LV1_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXACT_Bits.LV1 */
#define IFX_MCDSLIGHT_TCXACT_LV1_OFF (15u)

/** \brief Length for Ifx_MCDSLIGHT_TCXACT_Bits.AIS2 */
#define IFX_MCDSLIGHT_TCXACT_AIS2_LEN (5u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXACT_Bits.AIS2 */
#define IFX_MCDSLIGHT_TCXACT_AIS2_MSK (0x1fu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXACT_Bits.AIS2 */
#define IFX_MCDSLIGHT_TCXACT_AIS2_OFF (16u)

/** \brief Length for Ifx_MCDSLIGHT_TCXACT_Bits.AIQ2 */
#define IFX_MCDSLIGHT_TCXACT_AIQ2_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXACT_Bits.AIQ2 */
#define IFX_MCDSLIGHT_TCXACT_AIQ2_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXACT_Bits.AIQ2 */
#define IFX_MCDSLIGHT_TCXACT_AIQ2_OFF (21u)

/** \brief Length for Ifx_MCDSLIGHT_TCXACT_Bits.LV2 */
#define IFX_MCDSLIGHT_TCXACT_LV2_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXACT_Bits.LV2 */
#define IFX_MCDSLIGHT_TCXACT_LV2_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXACT_Bits.LV2 */
#define IFX_MCDSLIGHT_TCXACT_LV2_OFF (23u)

